app/views/protocols/_show.html.erb

SELECT "protocols".* FROM "protocols" WHERE "protocols"."product_id" = $1  [["product_id", 1]]
---
<div>
    <% product.protocols.each do |protocol| %>