app/controllers/protocols_controller.rb

  def new
    @protocol = Protocol.new
    @product = Product.find(params[:product_id])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]